/*
Протабулювати функцію на проміжку [a,b] з кроком h двома способами.

Для обчислення значення, заданої згідно варіанту функції y в точці x∈[a,b]:
1) першим способом: оголосити і реалізувати функцію мовою С, формальним параметром якої є x, а результатом функції є значення y;
2) другим способом: оголосити і реалізувати функцію мовою С, першим формальними параметром функції є x, другим формальним параметром є аргумент, куди буде повернено результат обчислення за формулою. 
Функція повертає:

−1, якщо y<0; 
0, якщо y=0;
1, якщо y>0.

Табуляцію оформити у вигляді окремої функції. Результати обчислень подати у вигляді таблиці.
Всі функції розмістити в заголовному файлі.
 */

#include <stdio.h>
#include "table_function.h"

int main(){
 
    float h = 0, a = 0, b = 0;
    
    printf("Enter a: ");
    scanf("%f", &a);
    printf("Enter b: ");
    scanf("%f", &b);
    printf("Enter step: ");
    scanf("%f", &h);
    
    tabulation_1(a, b, h);
    tabulation_2(a, b, h);
    
    return 0;
}
