/*

Написати програму, яка реалізує визначення властивостей бінарного відношення R1, заданого переліком елементів на множині А={1,2,3,4}.
Вказати, чи є дане відношення відношенням еквівалентності, толерантності, порядку.

Програма має передбачати такі можливості:
- введення вхідних даних вручну (задання відношення матрицею);
- реалізацію дослідження та визначення властивостей бінарного відношення;
- виведення результату досліджень властивостей заданого відношення та повідомлення, чи є
дане відношення відношенням еквівалентності, толерантності, порядку.

*/

#include <stdio.h>
#include "func_features.h"
#define N 4

int main() {
    
    int arr[N][N] = {
        {1, 1, 1, 0},
        {0, 1, 1, 0},
        {0, 0, 1, 0},
        {0, 0, 0, 0}
    };
    
    relation(arr);
    
    return 0;
}
